#+property: header-args:jupyter-python :session *jupyter* :eval no-export :async yes :tangle gen_graph.py :prologue "%%time" :exports both

* Read Graph

#+begin_src jupyter-python :noweb yes :exports none :results none
  <<imports>>
#+end_src

First we need to load the data from the /parquet/ file. The tangled
script will take the file name using a command line argument.

#+begin_src jupyter-python :eval no :noweb-ref imports :tangle no
  import sys
#+end_src

#+begin_src jupyter-python :eval no
  if len(sys.argv) >= 1:
      datafile = sys.argv[1]
  else:
      sys.exit("Missing one argument. The first argument should be the data file.")
#+end_src

In the org file it suffices to change the datafile header variable.

#+begin_src jupyter-python :noweb-ref imports :tangle no
  import pandas as pd
  import networkit as nk
  import networkx as nx
#+end_src

#+header: :var datafile="../../chunks/c00421.parquet"
#+begin_src jupyter-python
  # Read data and keep just the url features.
  df = pd.read_parquet(datafile, engine="fastparquet")
  print(len(df))
#+end_src

#+RESULTS:
: 66354
: CPU times: user 4.63 s, sys: 2.52 s, total: 7.15 s
: Wall time: 7.24 s

We will only need the =url= and =links= columns to create our graph,
so we drop every other column. We also only consider valid web
responses with a status code between 200 and 299.

#+begin_src jupyter-python
  df = df[(df.status >= 200) & (df.status < 300)]
  df.drop([
      "id", "domain", "timestamp", "duration", "http_version", "status", "header", "type", "text"
  ], axis=1, inplace=True)
#+end_src

#+RESULTS:
: CPU times: user 34.3 ms, sys: 4.15 ms, total: 38.4 ms
: Wall time: 34.4 ms

To reduce the amount of data without losing too much insight, we will
use just the domains including subdomains instead of the whole url and
need to adjust the column accordingly. We do this with regex matching.

#+begin_src jupyter-python :noweb-ref imports :tangle no
  import json
  import re
#+end_src

#+begin_src jupyter-python
  # Reduce urls to juts their domain and subdomain part.
  domain = re.compile(r'.*//([^/\?]*)(/|\?)?.*')
  get_domain = lambda x: domain.match(x).groups()[0]

  df["url"] = df["url"].apply(get_domain)
  df["links"] = df["links"].apply(
      lambda x: set(map(get_domain, json.loads(x)))
  )
#+end_src

#+RESULTS:
: CPU times: user 19.6 s, sys: 915 ms, total: 20.5 s
: Wall time: 20.5 s

Next, we need to create a graph from the data. For this we use
[[https://networkx.org/][NetworkX]]. The graph will have
- a node for every crawled website that
  is entry in the database,
- and an directed edge for every link from one website to anoter website
  in the database.
But since the data is not necessarily complete, we need to make sure
to ignore all links to urls outside of the database.

Since nodes are represented as integers internally, we have to figure
out a mapping from urls to ints. The index of df would be the easiest
answer, but figuring out the index of a url is linear in time. Thus we
will first sort the database index by the urls lexicographically,
which will in turn enable us to find an index in logarithmic
time. This requires [[https://numpy.org/][numpy]].

*IDEA*: Use hashes instead. These will not be incremental but won't
require a lookup table when processing all of the data.

#+begin_src jupyter-python :results none :noweb-ref imports :tangle no
  import numpy as np
#+end_src

#+begin_src jupyter-python :results none
  # Create unique sorted url index for fast lookups.
  df.sort_values("url", inplace=True)
  df.reset_index(inplace=True)
  df.drop('index', axis=1, inplace=True)
  index = np.unique(df.url.to_numpy())

  G = nx.DiGraph()
  for i in range(len(index)):
      G.add_node(i)
#+end_src

Now we can finally also add our edges. We also assign weights to our edges:
This happens by aggregating all our links from the same domain into one edge
weight. Since this is also just a snapshot of our data all links that are not
found in the index will be ignored.

#+begin_src jupyter-python :noweb-ref imports :tangle no
  from collections import Counter
#+end_src

#+begin_src jupyter-python
  # Aggregate data points with the same url and create a corresponding weighted
  # edge in the graph.
  for i, url in enumerate(index):
      il = df.url.searchsorted(url, side="left")
      ir = df.url.searchsorted(url, side="right")
      
      c = Counter()
      for idx in range(il, ir):
          for l in df.links.iloc[idx]:
              c[l] += 1
      c = dict(c)

      # Calculate edge weights
      for k,v in c.items():
          w = v / (ir - il)
          j = index.searchsorted(k)
          if j >= 0 and j < len(index) and index[j] == k:
              G.add_edge(i, j, weight=w)
#+end_src

#+RESULTS:
: CPU times: user 16 s, sys: 240 ms, total: 16.2 s
: Wall time: 16.2 s

* Graph Analysis

A simple first thing to look at might be the strongly connected components of
the graph. Since most sites link to themselves, we will only consider
components of size greater than one.

#+begin_src jupyter-python
  SCC = list(nx.strongly_connected_components(G))
  cs = [c for c in SCC if len(c) > 1]
  print(len(SCC), len(cs))
  for c in cs:
      print([index[i] for i in c])
#+end_src

#+RESULTS:
#+begin_example
  ['thesouthofheaven.tumblr.com', '187um-killa-trill.tumblr.com']
  ['www.projectnexium-sandbox.wikidot.com', 'projectnexium.wikidot.com']
  ['bekk.no', 'www.bekk.no']
  ['2021.ref.ac.uk', 'results2021.ref.ac.uk']
  ['recruit.caddi.tech', 'caddi.tech']
  ['itu.opengamingnetwork.com', 'wrmsrd.opengamingnetwork.com', 'osesrd.opengamingnetwork.com', 'pf2.d20pfsrd.com', 'pf2orc.d20pfsrd.com', 'true20srd.opengamingnetwork.com', 'www.d20herosrd.com', 'acksrd.opengamingnetwork.com', '2d20srd.opengamingnetwork.com', 'cairnsrd.opengamingnetwork.com', 'grimwildsrd.opengamingnetwork.com', 'www.13thagesrd.com', '4csrd.com', 'www.starjammersrd.com', 'bfsrd.opengamingnetwork.com', 'godsandmonsters.opengamingnetwork.com', 'www.35srd.com', 'www.traveller-srd.com', 'fatecoresrd.opengamingnetwork.com', 'articles.opengamingnetwork.com', 'everydaysrd.opengamingnetwork.com', 'www.5esrd.com', 'www.dungeonworldsrd.com']
  ['hemslojdsguiden.se', 'www.365slojd.se', '365slojd.se']
  ['money.onliner.by', 'ab.onliner.by', 'support.onliner.by', 'www.onliner.by', 'go.onliner.by']
  ['abonnement.monitormedier.dk', 'naturmonitor.dk']
  ['nanocad.ru', 'academy.nanocad.ru', 'braind.agency', 'forum.nanocad.ru', 'www.nanocad.ru']
  ['userinterviews.com', 'academy.userinterviews.com']
  ['microsoft-edge.en.uptodown.com', 'opera-browser.en.uptodown.com', 'opera.en.uptodown.com', 'supervpn-free-vpn-client.en.uptodown.com']
  ['quark-browser.en.uptodown.com', 'aloha-browser-turbo.en.uptodown.com', 'total-adblock-for-samsung.en.uptodown.com', 'adblock-plus-for-android.en.uptodown.com']
  ['www.astro.unige.ch', 'webserver.javalab.ua.es', 'ahead.iaps.inaf.it']
  ['aholddelhaize.com', 'newsroom.aholddelhaize.com']
  ['www.aikatsu.net', 'aikatsu-academy.com']
  ['www.ajefo.ca', 'ajefo.ca']
  ['veggiechallenge.de', 'proveg.com']
  ['alfatv.pl', 'bip.zdit-koszalin.pl']
  ['gryffindors.com', 'thewildrose.org', 'lectersgirl.altervista.org']
  ['dreamvalley.neocities.org', 'angelhotspot.neocities.org']
  ['angelzmindz.neocities.org', 'users2.smartgb.com']
  ['bookstooge.wordpress.com', 'wordaholicanonymous.wordpress.com']
  ['mechanicalanimereviews.com', 'drunkenanimeblog.com', 'melinanimeland.wordpress.com', 'mibih.wordpress.com', 'katthemovies.wordpress.com', 'thereviewheap.home.blog']
  ['www.polarismedia.no', 'www.lister24.no', 'folk.lister24.no']
  ['anoddreindeer.tumblr.com', 'shrikeseams.com']
  ['spencersunshine.com', 'antifascistnews.net']
  ['status.apaleo.com', 'identity.apaleo.com', 'apaleo.com', 'apaleo.dev']
  ['newsroom.kairosfuture.com', 'api.client.notified.com']
  ['cosmicgirlfriend.tumblr.com', 'aplaydatewithmyinnerchild.tumblr.com']
  ['help.youform.com', 'app.youform.com']
  ['area9lyceum.de', 'ar.area9lyceum.com', 'area9lyceum.it']
  ['archcraft.io', 'wiki.archcraft.io']
  ['myshinyworld.tumblr.com', 'homeothermic.tumblr.com']
  ['arts.ca.gov', 'www.caculturaldistricts.org']
  ['artsallianceva.org', 'vibecreativedistrict.org']
  ['bookmate-books-and-audiobooks.uptodown.com', 'ary-podcast.uptodown.com']
  ['www.ko-fi.com', 'rottiedollheart.neocities.org']
  ['blog.atari-frosch.de', 'atari-frosch.de']
  ['www.shipengine.com', 'auctane.com']
  ['william-ontheinternet.tumblr.com', 'awritersrejections.tumblr.com', 'lostinhistory.tumblr.com']
  ['axite.io', 'www.ax-semantics.com']
  ['axlraimi.nekoweb.org', 'tohellwithit.nekoweb.org']
  ['biomusterregionen-bw.de', 'www.bio-aus-bw.de']
  ['beechresort-fleesensee.com', 'www.beechresort-boltenhagen.com']
  ['kingbuffalo.bandcamp.com', 'beholdtheelder.bandcamp.com']
  ['desmoines.highlineschools.org', 'mcmicken.highlineschools.org', 'parkside.highlineschools.org', 'northhill.highlineschools.org', 'hhs.highlineschools.org', 'glacier.highlineschools.org', 'chinook.highlineschools.org', 'waskowitz.highlineschools.org', 'tyee.highlineschools.org', 'innovationheights.highlineschools.org', 'gregory.highlineschools.org', 'mountview.highlineschools.org', 'jobs.highlineschools.org', 'staff.highlineschools.org', 'beverlypark.highlineschools.org', 'cascade.highlineschools.org', 'pacific.highlineschools.org', 'madrona.highlineschools.org']
  ['misplacedbaggage.wordpress.com', 'kadnexus.wordpress.com', 'www.thelostdaughters.com', 'ethnicallyincorrect.wordpress.com', 'birthproject.wordpress.com', 'resistracism.wordpress.com']
  ['blog.crystalyx.net', 'tsubakimono.camelia-studio.org', 'bluewave.fm']
  ['www.drdishbasketball.com', 'blog.drdishbasketball.com', 'info.drdishbasketball.com']
  ['freelancersunion.org', 'blog.freelancersunion.org']
  ['blog.virginconnect.com', 'roam.virginconnect.com']
  ['blyaaaaatman.wikidot.com', 'rosenberg-krupp-skoda-grumman.wikidot.com']
  ['www.amishcountrylodging.com', 'book.amishcountrylodging.com']
  ['survivor-org.wikia.com', 'brantsteele.com', 'brantsteele.org']
  ['breakdownsbuttlights.tumblr.com', 'decepti-thots.tumblr.com']
  ['geofffff.blogspot.com', 'calevbenyefuneh.blogspot.com', 'daphneanson.blogspot.com']
  ['campus.quipper.com', 'www.quipper.com']
  ['eggsinthewind.tumblr.com', 'cancersyndrome.tumblr.com']
  ['wi-fu.tumblr.com', 'capricornsims.tumblr.com']
  ['captain-suspenders.tumblr.com', 'wewillgo-onforever.tumblr.com']
  ['catalogue.bulac.fr', 'www.efeo.fr']
  ['certsign.ro', 'shop.certsign.ro']
  ['charlieputh.fandom.com', 'louistomlinson.fandom.com']
  ['margaretkilljoy.substack.com', 'poorprolesalmanac.substack.com']
  ['christopherlbennett.wordpress.com', 'daybreakmagazine.wordpress.com']
  ['zebruh.tumblr.com', 'cidic.tumblr.com']
  ['climate-xchange.org', 'www.climatepolicydashboard.org']
  ['wiki.clonehero.net', 'clonehero.net']
  ['talos-the-mourning-vessel.tumblr.com', 'collision-ant.tumblr.com']
  ['community.tetra4d.com', 'tetra4d.com']
  ['learn.ecovillage.org', 'nextgen-ecovillage.org', 'ecovillage.org']
  ['forum.ic.org', 'ic.org', 'communityfinders.com', 'icmatch.org']
  ['conscienceandconsciousness.com', 'www.philipgoffphilosophy.com']
  ['copyrightregistrationservice.com', 'intellectualpropertyrightsoffice.org']
  ['event.opro.net', 'www.opro.net', 'corp.opro.net', 'spc.opro.net']
  ['www.corumgroup.com', 'corumgroup.libsyn.com']
  ['craigfernandez.tumblr.com', 'yungcrybby-anonymousbosch666.tumblr.com']
  ['zaufaneopinie.smile.pl', 'crazyneedles.pl']
  ['winston-ramone.tumblr.com', 'dana-chan-the-control-brain.tumblr.com']
  ['datalend.com', 'www.equilend.com', 'orbisa.com']
  ['fr.prolewiki.org', 'pt.prolewiki.org', 'ru.prolewiki.org', 'es.prolewiki.org', 'el.prolewiki.org', 'de.prolewiki.org', 'en.prolewiki.org', 'zh.prolewiki.org', 'fa.prolewiki.org']
  ['magicalgirlfia.tumblr.com', 'dedf1shloveblog.tumblr.com', 'vampire-pierrot.tumblr.com']
  ['www.wheelt.pt', 'www.isjd.pt']
  ['docs.folio.org', 'dev.folio.org']
  ['joshcomix.wordpress.com', 'diningwithstrangers.com']
  ['www.stackone.com', 'docs.stackone.com', 'stackone.com']
  ['dominateeye.tumblr.com', 'pauein.tumblr.com']
  ['not-a-robot-i-swear.tumblr.com', 'dyneue.tumblr.com']
  ['electronicgallery.tumblr.com', 'gallusdrawseverything.tumblr.com']
  ['endowment.hse.ru', 'spasibo.hse.ru', 'icef.hse.ru', 'finance.hse.ru']
  ['radnext.web.cern.ch', 'irradiation-facilities.web.cern.ch']
  ['www.rich2020.eu', 'erigrid2.eu']
  ['www.mainichigrillbu.com', 'for-biz.noritz.co.jp', 'form.noritz.co.jp', 'mypage.noritz.co.jp', 'faq.noritz.co.jp']
  ['fiftyshadesofgreywiki.tumblr.com', 'thefashionwiki-blog.tumblr.com', 'thedietwiki.tumblr.com']
  ['ggpi.blogspot.com', 'findyou.blogspot.com']
  ['foampro.com', 'fireresearch.com']
  ['fishzlgroup.ru', 'foodforfitness.ru']
  ['flowersinbloomnothingtoaddteatime.wordpress.com', 'thebookwormdrinketh.com']
  ['fpdcc.com', 'www.brookfieldzoo.org', 'www.czs.org']
  ['orders.gelatex.com', 'gelatex.com']
  ['russian.languagedaily.com', 'german.languagedaily.com']
  ['gotamedia.se', 'www.gotamedia.se']
  ['gotladies.tumblr.com', 'merlinadementiasnow.tumblr.com', 'joanna-lannister.tumblr.com']
  ['heavenssexiestangel.tumblr.com', 'spnfanficpond.tumblr.com']
  ['store.stamps.com', 'help.stamps.com']
  ['intti.fi', 'merivoimat.fi', 'maanpuolustuskorkeakoulu.fi', 'upseeriksi.fi', 'ilmavoimat.fi']
  ['industrial.seasonic.com', 'investor.seasonic.com']
  ['nnw.ranchero.com', 'inessential.com']
  ['iphodblog.blogspot.com', 'www.iphod.com']
  ['is.waw.pl', 'is.rzeszow.pl']
  ['itre.ncsu.edu', 'www.ncbussafety.org']
  ['jucaramarcal.bandcamp.com', 'jadsa.bandcamp.com']
  ['plenti.co', 'jantcu.com']
  ['www.covalliero.com', 'katalog.kerbl.com']
  ['tonyballantyne.com', 'keithbrooke.wordpress.com']
  ['lilas22.exblog.jp', 'uluru115.exblog.jp']
  ['www.loket.com', 'loket.com']
  ['nemosquirrel.tumblr.com', 'spacialdimension.tumblr.com']
  ['seethawithus.tumblr.com', 'seaairra.tumblr.com']
  ['ulvesang.bandcamp.com', 'muskoxofficial.bandcamp.com', 'thurnin.bandcamp.com']
  ['wondertrio.tumblr.com', 'mandiminimojo.tumblr.com']
  ['omarandjohnny.tumblr.com', 'mandrakebrew.tumblr.com']
  ['www.medizinischerdienst.de', 'md-bund.de', 'www.igel-monitor.de']
  ['norr.iogt.se', 'mitt.iogt.se', 'ost.iogt.se', 'pumpen.iogt.se', 'sydost.iogt.se']
  ['museumstudiesabroad.org', 'popkult.org']
  ['naoseidesenhar.substack.com', 'navisorbi.substack.com']
  ['nat.org.uk', 'www.nat.org.uk']
  ['zapiskijoanny30.wordpress.com', 'zyciecelta.wordpress.com', 'niecodziennik.org']
  ['teddyberr.tumblr.com', 'nyanbinaryrose.tumblr.com']
  ['oilcountryhq.com', 'oilersgamedaylive.com']
  ['panpteryx.tumblr.com', 'wyrddogs.tumblr.com']
  ['planetrdf.com', 'www.dajobe.org']
  ['wiki.pointlinux.org', 'pointlinux.org']
  ['ponvoryus.com', 'www.vandapharma.com']
  ['shaeeldera.tumblr.com', 'skirris.tumblr.com']
  ['rabbitroom.substack.com', 'rabbitroommusic.substack.com', 'store.rabbitroom.com', 'rabbitroom.com']
  ['raven-2.de.uptodown.com', 'raven-2.uptodown.com']
  ['www.hnd.hr', 'safejournalists.net']
  ['scp-wiki-nos.wikidot.com', 'scpsandboxnos.wikidot.com']
  ['undercoverbrellla.tumblr.com', 'whimsipunk.tumblr.com', 'ten-mou.tumblr.com']
  ['www.onehope.net', 'store.onehope.net']
  ['www.sundials.org', 'sundials.org']
  ['support.stride.zone', 'www.stride.zone']
  ['wiki.freshtomato.org', 'www.linksysinfo.org']
  ['www.unicohotels.com', 'www.thelodgemallorca.com', 'www.theprincipalmadridhotel.com', 'www.fincaserenamallorca.com', 'www.fincalabobadilla.com', 'theluxuryeditor.com']
  ['www.therex.ca', 'therex.ca', 'www.therexshop.ca']
  ['thinkpad-forum.de', 'thinkwiki.de']
  ['trustedtraders.which.co.uk', 'which.co.uk', 'whichwills.which.co.uk']
  ['veganshop.gmbh', 'www.veganbook.info', 'www.provegan.info']
  ['www.ua-bw.de', 'verbraucherportal-bw.de']
  ['webpub2.igae.hacienda.gob.es', 'www.oficinavirtual.pap.hacienda.gob.es']
  ['webshop.provendo.no', 'www.provendo.no']
  ['wiki.iots.vip', 'www.iots.vip']
  ['wiki.recalbox.com', 'www.recalbox.com']
  ['www.jinnianlun.cn', 'www.jipinhong.cn', 'www.jixif.cn', 'www.jlhuoyun.cn', 'www.jlxty.cn', 'www.jmsjp.com.cn', 'www.jndpf.org.cn', 'www.jnksq.cn', 'www.job5191.cn', 'www.jobss.com.cn', 'www.joryl.cn', 'www.jpcabal.cn', 'www.jsbcf.cn', 'www.jsbyzj.cn', 'www.jsfsx.com.cn', 'www.jshbkjgs.cn', 'www.jshiggs.cn', 'www.jsnw.com.cn', 'www.jssjgxxw.cn', 'www.jsywl.cn', 'www.juhuibao.com.cn', 'www.julinfloor.cn', 'www.jupaio.com.cn', 'www.jxchangrong168.cn', 'www.jyjyj.cn', 'www.k345.cn', 'www.kaikenuo.cn', 'www.kaitedj.cn', 'www.kaizhou-edu.cn', 'www.kancept.cn', 'www.kedele.cn', 'www.keidang.com.cn', 'www.kelinsi.cn', 'www.kellymoss.com.cn', 'www.keyu.net.cn', 'www.kfkeji.cn', 'www.khanate.cn', 'www.kijkbxw.cn', 'www.kindak.cn', 'www.komba.cn', 'www.konjacgum.com.cn', 'www.kpdsxw.cn', 'www.kq86.cn', 'www.kuangshan.net.cn', 'www.kucap.cn', 'www.ladj.com.cn', 'www.lareboss.cn', 'www.lc95.cn', 'www.lcpipe.cn', 'www.lcqsn.org.cn', 'www.lelaso.com.cn', 'www.lemonhotel.cn', 'www.lfjj8.cn', 'www.lilangjx.cn', 'www.llmc8.cn', 'www.lnch.com.cn', 'www.lounue.cn', 'www.lovelymama.cn', 'www.loves22.cn', 'www.lovoshop.cn', 'www.lqcmmc.cn', 'www.lqm889.cn', 'www.lqrgj.cn', 'www.lrogen.cn', 'www.ltic.com.cn', 'www.luhongsuye.cn', 'www.luxrose.cn', 'www.luyjpa.cn', 'www.lvzejun.cn', 'www.ly519.cn', 'www.lycdsy.cn', 'www.lygcec.cn', 'www.lyjbt.cn', 'www.lyswdx.cn', 'www.lzhwzl.cn', 'www.m216.cn', 'www.madier.com.cn', 'www.maincom.com.cn', 'www.makesoft.com.cn', 'www.maltaese.com.cn', 'www.manong.net.cn', 'www.maxigo.com.cn', 'www.mcjmxx.cn', 'www.megsine.cn', 'www.meidabz.cn', 'www.meishujiameng.cn', 'www.meizhiquan.cn', 'www.merrykey.cn', 'www.metalz.com.cn', 'www.mfrank.cn', 'www.miaomiaobei.cn', 'www.midea020.com.cn', 'www.mikebag.com.cn', 'www.milan-station.cn', 'www.mingsheshangxuan.cn', 'www.mishu99.cn', 'www.mmbuy.cn', 'www.mmyj.com.cn', 'www.mnjxc.cn', 'www.moershen.com.cn', 'www.mold-industry.cn', 'www.mortisingmachine.com.cn', 'www.muxika.com.cn', 'www.myhousecare.com.cn', 'www.mytalents.com.cn', 'www.nanlace.com.cn', 'www.nbbus.com.cn', 'www.nbhwwh.cn', 'www.nblkq02.cn', 'www.nbmagnet.cn', 'www.nc365.cn', 'www.nethn.cn', 'www.neunited.cn', 'www.new-new.cn', 'www.nicepar.cn', 'www.nj-sy.cn', 'www.njrgw.cn', 'www.njspx.com.cn', 'www.nju-edu.cn', 'www.njwdkj.cn', 'www.nnls.net.cn', 'www.nongyeshebei.cn', 'www.nooaoo.cn', 'www.nphjw.cn', 'www.nxlhwhysp.cn', 'www.nyhtt.cn', 'www.oneting.cn', 'www.ootfirz.cn', 'www.osdeng.cn', 'www.osxg.com.cn', 'www.palak.cn', 'www.pan-art.cn', 'www.pandababy.com.cn', 'www.panx.com.cn', 'www.papiorecycle.cn', 'www.parkal.com.cn', 'www.pieda.cn', 'www.pingdinglian.cn', 'www.pkups.com.cn', 'www.pl-pefilm.cn', 'www.pop-mm.cn', 'www.princeofpeace.cn', 'www.proteusfitness.cn', 'www.protex.net.cn', 'www.pstry.cn', 'www.ptan.cn', 'www.ptzzb.cn', 'www.pubad.com.cn', 'www.pushite.cn', 'www.pytyjy.net.cn', 'www.qcxmk.cn', 'www.qdone.cn', 'www.qdsptgm.cn', 'www.qdxintai.cn', 'www.qianbanjiage.cn', 'www.qifugu.com.cn', 'www.qingyanghualv.com.cn', 'www.qiyongdong.cn', 'www.qjba.cn', 'www.qlif.cn', 'www.qm139.com.cn', 'www.qnfty.cn', 'www.qs-zm.cn', 'www.qutaobao.cn', 'www.qxjh.cn', 'www.qyxbw.cn', 'www.qzjiuhua.com.cn', 'www.rdsptech.cn', 'www.redbaobao.cn', 'www.ree.net.cn', 'www.rockins.cn', 'www.romond.cn', 'www.ruanzhoubeng.cn', 'www.ruicaotang.cn', 'www.ruidisen.cn', 'www.russiaguoxin.cn', 'www.salira.com.cn', 'www.sanhehg.cn', 'www.sbytech.cn', 'www.scqsq.cn', 'www.sdevent.cn', 'www.sdhry.com.cn', 'www.sdicl.com.cn', 'www.sdlove.com.cn', 'www.sdyingyue.cn', 'www.senliao.com.cn', 'www.seotop1.cn', 'www.sfj1236.com.cn', 'www.sglsw.com.cn', 'www.sh-wood.com.cn', 'www.shautoexpo.org.cn', 'www.shbashiwl.cn', 'www.shchenwang.com.cn', 'www.shengjiemoye.cn', 'www.shengxingabion.cn', 'www.shhc.org.cn', 'www.shhqw.com.cn', 'www.shhydl.cn', 'www.shiningblue.cn', 'www.shoueryouyang.cn', 'www.shrailway.com.cn', 'www.shsose.com.cn', 'www.shtkrkq.cn', 'www.shubiao.net.cn', 'www.shuhuazhi.cn', 'www.shunhead.cn', 'www.shzhiying.cn', 'www.shzkb.cn', 'www.sjksgs.cn', 'www.sjmhg.com.cn', 'www.sjmyjd.cn', 'www.sjmz.com.cn', 'www.sjtvip.cn', 'www.sk010.cn', 'www.skmtech.cn', 'www.slrfl.cn', 'www.smartaudit.com.cn', 'www.sn999.cn', 'www.snmen.cn', 'www.snweifeng.cn', 'www.songyouhui.cn', 'www.sosolala.com.cn', 'www.space-time.com.cn', 'www.spfbw.cn', 'www.sq148.com.cn', 'www.srfengguanji.cn', 'www.sscar.com.cn', 'www.stadytime.cn', 'www.staei.cn', 'www.stageline.cn', 'www.stamp99.cn', 'www.steel-grating.cn', 'www.stock6678.cn', 'www.stopthatsnoring.com.cn', 'www.suisuipingan.com.cn', 'www.sunhaiwei.cn', 'www.sunnybay.com.cn', 'www.sustid.cn', 'www.suval.com.cn', 'www.sxoffice.com.cn', 'www.sxtdybio.cn', 'www.sxxrbz.cn', 'www.sycste.org.cn', 'www.sygydxxb.cn', 'www.syxscy.cn', 'www.sz-zhw.cn', 'www.sz2783.cn', 'www.szbgs.com.cn', 'www.szhuanair.com.cn', 'www.szjinyu.cn', 'www.szjy88.cn', 'www.szmt56.cn', 'www.szpsf.cn', 'www.szqctsy.cn', 'www.szqxwq.cn', 'www.szryxgd.com.cn', 'www.szxaoa.cn', 'www.t44867k.cn', 'www.chongqingbidan.cn', 'www.tchjd.cn', 'www.test99.com.cn', 'www.010316.com.cn', 'www.thepaper.net.cn', 'www.023-tl.cn', 'www.0411autos.cn', 'www.0580u.cn', 'www.0592178.cn', 'www.thjdsb.cn', 'www.thkzxxx.cn', 'www.0816jcw.cn', 'www.tianlaicun.cn', 'www.0991led.cn', 'www.tianyugg.cn', 'www.100lang.cn', 'www.100msm.cn', 'www.100gps.com.cn', 'www.11d15c.cn', 'www.timings.cn', 'www.1236321.cn', 'www.12sgzjt.cn', 'www.tit.net.cn', 'www.tj800.cn', 'www.15977.cn', 'www.163edu.com.cn', 'www.tjnhsafety.cn', 'www.tjsszw.cn', 'www.17592.cn', 'www.tkdc.com.cn', 'www.17tb8.cn', 'www.tld.net.cn', 'www.tlxuba.cn', 'www.17thjsgames.org.cn', 'www.1d1l.org.cn', 'www.2020777.cn', 'www.202078.cn', 'www.21dmedia.net.cn', 'www.21it.com.cn', 'www.tlfrk.cn', 'www.2222110.cn', 'www.234zhe.cn', 'www.tongjijujia.cn', 'www.tongchuntang.com.cn', 'www.25427187.cn', 'www.26333.cn', 'www.tongfasolar.cn', 'www.2cha.cn', 'www.28sj.net.cn', 'www.tooren.cn', 'www.topvista.cn', 'www.339966.com.cn', 'www.360qvod.cn', 'www.tradevv.cn', 'www.traditionalmedicine.com.cn', 'www.3n168.cn', 'www.3wsj.cn', 'www.3xwd.cn', 'www.trafficabc.cn', 'www.414313.com.cn', 'www.47177.cn', 'www.4kuu.cn', 'www.51777888.cn', 'www.tsyimin.cn', 'www.51jiankang.com.cn', 'www.51kafu.cn', 'www.ttua.cn', 'www.ttmmuyegs.cn', 'www.51sd.com.cn', 'www.520wenda.cn', 'www.52dgou.cn', 'www.tusafe.cn', 'www.52yjm.cn', 'www.55sssf.cn', 'www.56710.cn', 'www.5777777.cn', 'www.591ey.cn', 'www.ty39.cn', 'www.txhy-audio.com.cn', 'www.tz10000.cn', 'www.5wsh.cn', 'www.txty.com.cn', 'www.txyp185.cn', 'www.66kg.cn', 'www.5udns.cn', 'www.67303.com.cn', 'www.6781.com.cn', 'www.6825.org.cn', 'www.6d3.com.cn', 'www.uepu.cn', 'www.70847.cn', 'www.uiut.cn', 'www.6m.org.cn', 'www.ukonline.com.cn', 'www.ujnr.cn', 'www.77gou.com.cn', 'www.777ht.cn', 'www.uhn98.cn', 'www.80anmo.cn', 'www.unicome.cn', 'www.82691.cn', 'www.789mmm.cn', 'www.87ge.cn', 'www.88131420.cn', 'www.884444.com.cn', 'www.88miaomu.cn', 'www.uqen.cn', 'www.85012.cn', 'www.8xiu.com.cn', 'www.utosee.cn', 'www.uwds.cn', 'www.v3d.com.cn', 'www.91hubei.cn', 'www.vastchip.com.cn', 'www.abccompanies.com.cn', 'www.vastorient.com.cn', 'www.ac163.com.cn', 'www.acseo.cn', 'www.actword.cn', 'www.acutec.cn', 'www.adenstar.com.cn', 'www.vic365.cn', 'www.advtekgroup.com.cn', 'www.vnrg.cn', 'www.ahxhzy.cn', 'www.vr163.com.cn', 'www.vsg-ad.cn', 'www.w-qq.cn', 'www.wabaowang.com.cn', 'www.wailianwang.com.cn', 'www.wangkuandian.cn', 'www.akqe.cn', 'www.wangqicai.cn', 'www.wangyameit.cn', 'www.wangyongtuox.com.cn', 'www.alib.com.cn', 'www.wblshbx.cn', 'www.wdqkx.org.cn', 'www.webaiye.cn', 'www.alnmpci.cn', 'www.webtrend.cn', 'www.ampte.com.cn', 'www.weizailink.cn', 'www.weizhijiaoyu.cn', 'www.anandishanghai.cn', 'www.werc.cn', 'www.andeli88.com.cn', 'www.westinvest.net.cn', 'www.westyy.cn', 'www.wfjdjx.cn', 'www.whatisultimate.cn', 'www.wheelstar.com.cn', 'www.whrsrc.cn', 'www.aojuan.cn', 'www.aolida-ic.cn', 'www.apearl.cn', 'www.aqst.com.cn', 'www.wklmy.com.cn', 'www.wm520.com.cn', 'www.wmoeck.cn', 'www.wnbe.cn', 'www.wo4000.com.cn', 'www.arkmid.cn', 'www.wode373.cn', 'www.wonf.cn', 'www.art360.com.cn', 'www.world-famous.com.cn', 'www.arthroscopy.cn', 'www.woyemaicha.com.cn', 'www.worldgift.com.cn', 'www.asiafriender.cn', 'www.wroz.cn', 'www.wucaige.cn', 'www.wxaw.org.cn', 'www.wyx007.cn', 'www.wz2.com.cn', 'www.xa77.cn', 'www.xalove.com.cn', 'www.xamj.net.cn', 'www.xamqy.org.cn', 'www.xaws.com.cn', 'www.xcgm.com.cn', 'www.avonair.com.cn', 'www.avast1.cn', 'www.xf701218.cn', 'www.xguv.com.cn', 'www.xiangyangyuju.cn', 'www.xianzengjia.cn', 'www.xiaoflash.cn', 'www.bakeyuansu.cn', 'www.ballaz.cn', 'www.xiaomoo.cn', 'www.bandao111.cn', 'www.xiebao361.cn', 'www.baoshengtai.cn', 'www.xindth.cn', 'www.xingfuyingyuan.com.cn', 'www.xinhongbo.cn', 'www.xinhuajinrong.cn', 'www.bb5y.com.cn', 'www.xinjiamei.com.cn', 'www.bczh.com.cn', 'www.xintai668.cn', 'www.xinqianyou.cn', 'www.xinmedia.cn', 'www.bdshyy.cn', 'www.xlfly.com.cn', 'www.beifengshan.com.cn', 'www.xinyuanshun.cn', 'www.xrcorp.com.cn', 'www.xsz123.com.cn', 'www.xt2.com.cn', 'www.xuancuiju.com.cn', 'www.xyditan.com.cn', 'www.bignature.com.cn', 'www.xytmc.com.cn', 'www.xzcl.org.cn', 'www.xzxxz.cn', 'www.yaozhaoshang.com.cn', 'www.ybhuntun.cn', 'www.ybzh.com.cn', 'www.bistone.cn', 'www.ycflxx.com.cn', 'www.bjdxh.com.cn', 'www.bjelc.com.cn', 'www.bjhkkj.cn', 'www.bjhyyf.cn', 'www.yczp5.cn', 'www.ydczns.com.cn', 'www.bjtongyao.com.cn', 'www.yesv.com.cn', 'www.yfdianxiaoka.cn', 'www.bjyzmd.cn', 'www.yhhenglish.cn', 'www.yi-sheng.cn', 'www.yida365.com.cn', 'www.blogkid.cn', 'www.yiment.cn', 'www.yingjia01.cn', 'www.bmg88.cn', 'www.bodakj.com.cn', 'www.yinhedl.cn', 'www.yiyizuche.cn', 'www.ykbm.com.cn', 'www.ykgg.com.cn', 'www.yls188.cn', 'www.bopie.com.cn', 'www.yluxuepian.cn', 'www.ynrnm.cn', 'www.ynjlms.cn', 'www.ynttt.com.cn', 'www.yohotalk.cn', 'www.yongshengjx.cn', 'www.bsd88.cn', 'www.ynsfwh.cn', 'www.youfamily.net.cn', 'www.youh.net.cn', 'www.youngel.cn', 'www.ysxjkjd.cn', 'www.ytjl168.cn', 'www.c-art.cn', 'www.c116.cn', 'www.yuansheying.com.cn', 'www.ytsmc.com.cn', 'www.cafebabe.cn', 'www.yumovip.cn', 'www.caihongqiao.org.cn', 'www.yuxibolt.cn', 'www.yuxiqing.cn', 'www.yuyuanxiang.cn', 'www.yufdc.cn', 'www.yxsite.com.cn', 'www.carjapan.com.cn', 'www.yzjly.cn', 'www.yzsfdc.cn', 'www.yzxx188.com.cn', 'www.cbdc1.cn', 'www.cby138.cn', 'www.cchengtai.cn', 'www.zbshebao.cn', 'www.ccyyi.cn', 'www.cddkfw.cn', 'www.cdsafety.com.cn', 'www.zdmapsj.cn', 'www.zdbmw.cn', 'www.cdwll.cn', 'www.zfmj.com.cn', 'www.zengbincc.cn', 'www.zggxiqy.cn', 'www.zbsugang.com.cn', 'www.cfuclub.cn', 'www.zgmmby.cn', 'www.zgpaz.cn', 'www.zgtaixu.cn', 'www.zgyxscw.com.cn', 'www.666cp.cn', 'www.cheeloosoft.com.cn', 'www.zhanglangkexing.cn', 'www.chemgoo.cn', 'www.zhanjiangwuliu.cn', 'www.chest.org.cn', 'www.zhaoji.net.cn', 'www.chengdawenzhou.cn', 'www.chidexiao.cn', 'www.chikee.com.cn', 'www.zhengloulipin.cn', 'www.zhilengqi.com.cn', 'www.zhilijiaren.cn', 'www.zhnyw.cn', 'www.zhongjian.net.cn', 'www.chstar.cn', 'www.zhongtai.net.cn', 'www.cifexpo.com.cn', 'www.zhongwone.cn', 'www.cjwu.cn', 'www.ckje.cn', 'www.chu-ming.com.cn', 'www.zhspw.com.cn', 'www.cilaya.cn', 'www.zhutanq.cn', 'www.zhwdw.cn', 'www.zj-one.cn', 'www.zj-zzhb.cn', 'www.zjbldlt.cn', 'www.zkeea.cn', 'www.cncns.cn', 'www.cncye.cn', 'www.zlhx.com.cn', 'www.zndxr.cn', 'www.cnkawayi.cn', 'www.cnlebao.cn', 'www.cnzkd.cn', 'www.zouzha.cn', 'www.zs-weike.cn', 'www.zrimp.cn', 'www.co998.cn', 'www.zshnet.cn', 'www.zshx88.com.cn', 'www.zsoa.com.cn', 'www.zt007.cn', 'www.zt386.cn', 'www.comef51.cn', 'www.zuoyuedoor.cn', 'www.colincctv.com.cn', 'www.zwwzdq.cn', 'www.zyzjq.com.cn', 'www.zz-dns.cn', 'www.zz001.com.cn', 'www.zzwy.com.cn', 'www.cqgyp.cn', 'www.cqsqfy.com.cn', 'www.cqwhmy.cn', 'www.cqxyg.com.cn', 'www.cqycc.org.cn', 'www.crep-led.cn', 'www.810086.com.cn', 'www.csspring.cn', 'www.ctscloud.cn', 'www.cuanet.org.cn', 'www.cxbook.com.cn', 'www.cz-xd.cn', 'www.czaxmy.cn', 'www.czcmjk.com.cn', 'www.czqahb.cn', 'www.cztengguan.cn', 'www.d1dy.cn', 'www.dajiawang.com.cn', 'www.dalianwk.cn', 'www.danif.cn', 'www.dansuan88.cn', 'www.daqiall.cn', 'www.dbyf.com.cn', 'www.ddxs.org.cn', 'www.dediu.cn', 'www.dfcjw.cn', 'www.dgeye.com.cn', 'www.dggaoda.cn', 'www.dghyfirm.cn', 'www.dgssjj.cn', 'www.dgxingao.com.cn', 'www.dicvideo.com.cn', 'www.dingleidoors.cn', 'www.dnsbw.com.cn', 'www.dosome.com.cn', 'www.downloading.com.cn', 'www.dr58.cn', 'www.drglass.cn', 'www.dseoul.cn', 'www.dsp-sz.cn', 'www.dtrclub.cn', 'www.dukemen.cn', 'www.dxt-data.cn', 'www.dy368.cn', 'www.dzzhjhsb.cn', 'www.e-youbao.cn', 'www.easyrecovery.com.cn', 'www.ecou.cn', 'www.edlk.cn', 'www.edrc.com.cn', 'www.egc.net.cn', 'www.egozone.cn', 'www.eguluomin.cn', 'www.eilv.com.cn', 'www.eliang.com.cn', 'www.enerbos.cn', 'www.enfi-yq.com.cn', 'www.engpv.com.cn', 'www.eoaoo.com.cn', 'www.eoopoo.com.cn', 'www.epioo.cn', 'www.eroda.net.cn', 'www.estsc.cn', 'www.faironline.com.cn', 'www.fanchaoo.cn', 'www.fayao.com.cn', 'www.fcnysbc.cn', 'www.feifan360.cn', 'www.feikedaili.cn', 'www.fenghuatea.cn', 'www.fengnaier.cn', 'www.feplc.cn', 'www.fgfkj.cn', 'www.firstar.net.cn', 'www.fjnh.com.cn', 'www.foammachine.cn', 'www.frontid.com.cn', 'www.fs-huamei.com.cn', 'www.fs-robot.cn', 'www.fshsdq.com.cn', 'www.fssdsh.cn', 'www.fstianyou.cn', 'www.fuliao.org.cn', 'www.funsan.cn', 'www.fuxx.cn', 'www.fuyisi.cn', 'www.fwt-a.cn', 'www.fzlexus.com.cn', 'www.gangsiwowo.cn', 'www.gaoxueya5.com.cn', 'www.gch.net.cn', 'www.gdwdy.cn', 'www.gefitinib.com.cn', 'www.geleite.cn', 'www.gfs8580.cn', 'www.ggitech.com.cn', 'www.ggj.net.cn', 'www.ggnkyy.cn', 'www.gicommittee.com.cn', 'www.gjjr.com.cn', 'www.gold0559.cn', 'www.gongfuyu.com.cn', 'www.good-pay.cn', 'www.gq365.cn', 'www.greenshow.cn', 'www.gszbz.com.cn', 'www.gt88.cn', 'www.guangfatent.cn', 'www.guanghuahuashi.cn', 'www.guojinvzhuangpifa.net.cn', 'www.guomao85.cn', 'www.guowei-pbx.com.cn', 'www.guoyuanwai.cn', 'www.gwcb.com.cn', 'www.gxsmjbi.cn', 'www.gyfudiao.cn', 'www.gz-sjkj.com.cn', 'www.gz8u8.cn', 'www.gzbhhd.cn', 'www.gzhlkj.cn', 'www.gzjieke.cn', 'www.gzjinrun.cn', 'www.gzjyb.com.cn', 'www.gzkjjs.cn', 'www.gzluodan.cn', 'www.gzsckw.cn', 'www.gzzj020.cn', 'www.haiandasha.cn', 'www.haizhifeng.cn', 'www.hansudj.cn', 'www.hanting114.cn', 'www.hanxueshop.cn', 'www.haojb.cn', 'www.hawkinfo.com.cn', 'www.hdqshy.cn', 'www.healthyst.com.cn', 'www.hemaie.cn', 'www.hezudao52.cn', 'www.hf-tech.cn', 'www.hfzxlw.cn', 'www.hgj.org.cn', 'www.hgldt.cn', 'www.hhjie.cn', 'www.hi-tone.cn', 'www.hi0543.cn', 'www.hifi5.com.cn', 'www.hiltondalian.cn', 'www.hitecmen.com.cn', 'www.hjgz18.cn', 'www.hlzhizao.cn', 'www.hmbiz.cn', 'www.hn88.cn', 'www.hnhzxtd.cn', 'www.hnslhzx.cn', 'www.hnydw.cn', 'www.hnyzssy.cn', 'www.hnzbdb.cn', 'www.hoboob.cn', 'www.hongtong168.cn', 'www.huaan168.com.cn', 'www.huagaoxi.cn', 'www.huaisutang.cn', 'www.huanghaiwang.com.cn', 'www.huangxibo.cn', 'www.huashuoel.cn', 'www.huidali.cn', 'www.hxbox.com.cn', 'www.hy663.cn', 'www.hydpf.org.cn', 'www.hytaxedu.cn', 'www.hzlsnz.cn', 'www.hztuoyu.cn', 'www.i-europe.cn', 'www.ia8848.cn', 'www.ibmcenter.com.cn', 'www.icclaw.com.cn', 'www.idc5588.cn', 'www.ie-baidu.cn', 'www.ih4.com.cn', 'www.ihongtu.cn', 'www.ikbpt.cn', 'www.ilebao.cn', 'www.im-ligang.cn', 'www.inonline.cn', 'www.interwest.com.cn', 'www.ionizedwater.cn', 'www.itku.com.cn', 'www.itwyw.cn', 'www.iweihai.com.cn', 'www.j-wanc.com.cn', 'www.jasminetea1.cn', 'www.javadown.com.cn', 'www.jbbabycare.cn', 'www.jbs-engines.com.cn', 'www.jf-net.com.cn', 'www.jfyfzgs.com.cn', 'www.jiahecaifu.cn', 'www.jiamengso.cn', 'www.jiayixuan.cn', 'www.jinboyifang.cn', 'www.jinfeng-sh.com.cn', 'www.jingmeiren.cn', 'www.jingyinxiang.cn', 'www.jinhuowang.com.cn']
  ['www.ryestreettavern.com', 'www.ebbitt.com', 'www.cordeliadc.com', 'www.clydesgroup.com', 'www.1789restaurant.com', 'www.tombs.com']
  ['www.capitalrowing.org', 'www.anacostiaboathouse.org']
  ['www.bakersdaughterdc.com', 'www.michelesdc.com', 'www.gravitasdc.com', 'www.giftrocker.com']
  ['www.bgsaxo.it', 'www.help.saxo']
  ['yau-contest.com', 'www.cms.zju.edu.cn']
  ['www.fujisash-grp-netshop.jp', 'www.facing-online.com', 'www.fujisash.co.jp']
  ['www.fackelmann.com', 'www.fackelmann.de']
  ['www.heristo.de', 'www.ferdi-fuchs.de', 'www.meat2000.de', 'www.youcook-food.com', 'www.servit.de', 'www.stockmeyer.de']
  ['www.montresalafrancaise.fr', 'www.franceclat.fr', 'www.formations-hbjo.com']
  ['www.kansai-helios.eu', 'www.greblon.com']
  ['www.linuxexpres.cz', 'www.openoffice.cz']
  ['www.nevadacitychamber.com', 'www.nevadacountyarts.org']
  ['www.ondemandkorea.com', 'www.odkmedia.net']
  ['www.rosenthal.de', 'www.paderno.it']
  ['www.wordfast.com', 'www.wordfast.net']
  CPU times: user 1.5 s, sys: 9.12 ms, total: 1.51 s
  Wall time: 1.51 s
#+end_example

* Working with super-massive graphs
- https://www.w3reference.com/blog/read-write-networkx-graph-object/#why-networkx-struggles-with-massive-graphs

What to do?
- store in chunks and stream data
- filtering while loading
- using efficient formats (parquet, gzipped tsv/csv)
- optimizing data types


* COMMENT experimental

# #+begin_src jupyter-python
#   SCC = nk.components.StronglyConnectedComponents(G)
#   SCC.run()
#   cs = [c for c in SCC.getComponents() if len(c) > 1]
#   for c in cs:
#       print([index[i] for i in c])
# #+end_src

#+begin_src jupyter-python
  SCC = list(nx.strongly_connected_components(G))
  cs = [c for c in SCC if len(c) > 1]
  print(len(SCC), len(cs))
  for c in cs:
      print([index[i] for i in c])
#+end_src

#+RESULTS:
#+begin_example
  12867 171
  ['thesouthofheaven.tumblr.com', '187um-killa-trill.tumblr.com']
  ['www.projectnexium-sandbox.wikidot.com', 'projectnexium.wikidot.com']
  ['bekk.no', 'www.bekk.no']
  ['2021.ref.ac.uk', 'results2021.ref.ac.uk']
  ['recruit.caddi.tech', 'caddi.tech']
  ['itu.opengamingnetwork.com', 'wrmsrd.opengamingnetwork.com', 'osesrd.opengamingnetwork.com', 'pf2.d20pfsrd.com', 'pf2orc.d20pfsrd.com', 'true20srd.opengamingnetwork.com', 'www.d20herosrd.com', 'acksrd.opengamingnetwork.com', '2d20srd.opengamingnetwork.com', 'cairnsrd.opengamingnetwork.com', 'grimwildsrd.opengamingnetwork.com', 'www.13thagesrd.com', '4csrd.com', 'www.starjammersrd.com', 'bfsrd.opengamingnetwork.com', 'godsandmonsters.opengamingnetwork.com', 'www.35srd.com', 'www.traveller-srd.com', 'fatecoresrd.opengamingnetwork.com', 'articles.opengamingnetwork.com', 'everydaysrd.opengamingnetwork.com', 'www.5esrd.com', 'www.dungeonworldsrd.com']
  ['hemslojdsguiden.se', 'www.365slojd.se', '365slojd.se']
  ['money.onliner.by', 'ab.onliner.by', 'support.onliner.by', 'www.onliner.by', 'go.onliner.by']
  ['abonnement.monitormedier.dk', 'naturmonitor.dk']
  ['nanocad.ru', 'academy.nanocad.ru', 'braind.agency', 'forum.nanocad.ru', 'www.nanocad.ru']
  ['userinterviews.com', 'academy.userinterviews.com']
  ['microsoft-edge.en.uptodown.com', 'opera-browser.en.uptodown.com', 'opera.en.uptodown.com', 'supervpn-free-vpn-client.en.uptodown.com']
  ['quark-browser.en.uptodown.com', 'aloha-browser-turbo.en.uptodown.com', 'total-adblock-for-samsung.en.uptodown.com', 'adblock-plus-for-android.en.uptodown.com']
  ['www.astro.unige.ch', 'webserver.javalab.ua.es', 'ahead.iaps.inaf.it']
  ['aholddelhaize.com', 'newsroom.aholddelhaize.com']
  ['www.aikatsu.net', 'aikatsu-academy.com']
  ['www.ajefo.ca', 'ajefo.ca']
  ['veggiechallenge.de', 'proveg.com']
  ['alfatv.pl', 'bip.zdit-koszalin.pl']
  ['gryffindors.com', 'thewildrose.org', 'lectersgirl.altervista.org']
  ['dreamvalley.neocities.org', 'angelhotspot.neocities.org']
  ['angelzmindz.neocities.org', 'users2.smartgb.com']
  ['bookstooge.wordpress.com', 'wordaholicanonymous.wordpress.com']
  ['mechanicalanimereviews.com', 'drunkenanimeblog.com', 'melinanimeland.wordpress.com', 'mibih.wordpress.com', 'katthemovies.wordpress.com', 'thereviewheap.home.blog']
  ['www.polarismedia.no', 'www.lister24.no', 'folk.lister24.no']
  ['anoddreindeer.tumblr.com', 'shrikeseams.com']
  ['spencersunshine.com', 'antifascistnews.net']
  ['status.apaleo.com', 'identity.apaleo.com', 'apaleo.com', 'apaleo.dev']
  ['newsroom.kairosfuture.com', 'api.client.notified.com']
  ['cosmicgirlfriend.tumblr.com', 'aplaydatewithmyinnerchild.tumblr.com']
  ['help.youform.com', 'app.youform.com']
  ['area9lyceum.de', 'ar.area9lyceum.com', 'area9lyceum.it']
  ['archcraft.io', 'wiki.archcraft.io']
  ['myshinyworld.tumblr.com', 'homeothermic.tumblr.com']
  ['arts.ca.gov', 'www.caculturaldistricts.org']
  ['artsallianceva.org', 'vibecreativedistrict.org']
  ['bookmate-books-and-audiobooks.uptodown.com', 'ary-podcast.uptodown.com']
  ['www.ko-fi.com', 'rottiedollheart.neocities.org']
  ['blog.atari-frosch.de', 'atari-frosch.de']
  ['www.shipengine.com', 'auctane.com']
  ['william-ontheinternet.tumblr.com', 'awritersrejections.tumblr.com', 'lostinhistory.tumblr.com']
  ['axite.io', 'www.ax-semantics.com']
  ['axlraimi.nekoweb.org', 'tohellwithit.nekoweb.org']
  ['biomusterregionen-bw.de', 'www.bio-aus-bw.de']
  ['beechresort-fleesensee.com', 'www.beechresort-boltenhagen.com']
  ['kingbuffalo.bandcamp.com', 'beholdtheelder.bandcamp.com']
  ['desmoines.highlineschools.org', 'mcmicken.highlineschools.org', 'parkside.highlineschools.org', 'northhill.highlineschools.org', 'hhs.highlineschools.org', 'glacier.highlineschools.org', 'chinook.highlineschools.org', 'waskowitz.highlineschools.org', 'tyee.highlineschools.org', 'innovationheights.highlineschools.org', 'gregory.highlineschools.org', 'mountview.highlineschools.org', 'jobs.highlineschools.org', 'staff.highlineschools.org', 'beverlypark.highlineschools.org', 'cascade.highlineschools.org', 'pacific.highlineschools.org', 'madrona.highlineschools.org']
  ['misplacedbaggage.wordpress.com', 'kadnexus.wordpress.com', 'www.thelostdaughters.com', 'ethnicallyincorrect.wordpress.com', 'birthproject.wordpress.com', 'resistracism.wordpress.com']
  ['blog.crystalyx.net', 'tsubakimono.camelia-studio.org', 'bluewave.fm']
  ['www.drdishbasketball.com', 'blog.drdishbasketball.com', 'info.drdishbasketball.com']
  ['freelancersunion.org', 'blog.freelancersunion.org']
  ['blog.virginconnect.com', 'roam.virginconnect.com']
  ['blyaaaaatman.wikidot.com', 'rosenberg-krupp-skoda-grumman.wikidot.com']
  ['www.amishcountrylodging.com', 'book.amishcountrylodging.com']
  ['survivor-org.wikia.com', 'brantsteele.com', 'brantsteele.org']
  ['breakdownsbuttlights.tumblr.com', 'decepti-thots.tumblr.com']
  ['geofffff.blogspot.com', 'calevbenyefuneh.blogspot.com', 'daphneanson.blogspot.com']
  ['campus.quipper.com', 'www.quipper.com']
  ['eggsinthewind.tumblr.com', 'cancersyndrome.tumblr.com']
  ['wi-fu.tumblr.com', 'capricornsims.tumblr.com']
  ['captain-suspenders.tumblr.com', 'wewillgo-onforever.tumblr.com']
  ['catalogue.bulac.fr', 'www.efeo.fr']
  ['certsign.ro', 'shop.certsign.ro']
  ['charlieputh.fandom.com', 'louistomlinson.fandom.com']
  ['margaretkilljoy.substack.com', 'poorprolesalmanac.substack.com']
  ['christopherlbennett.wordpress.com', 'daybreakmagazine.wordpress.com']
  ['zebruh.tumblr.com', 'cidic.tumblr.com']
  ['climate-xchange.org', 'www.climatepolicydashboard.org']
  ['wiki.clonehero.net', 'clonehero.net']
  ['talos-the-mourning-vessel.tumblr.com', 'collision-ant.tumblr.com']
  ['community.tetra4d.com', 'tetra4d.com']
  ['learn.ecovillage.org', 'nextgen-ecovillage.org', 'ecovillage.org']
  ['forum.ic.org', 'ic.org', 'communityfinders.com', 'icmatch.org']
  ['conscienceandconsciousness.com', 'www.philipgoffphilosophy.com']
  ['copyrightregistrationservice.com', 'intellectualpropertyrightsoffice.org']
  ['event.opro.net', 'www.opro.net', 'corp.opro.net', 'spc.opro.net']
  ['www.corumgroup.com', 'corumgroup.libsyn.com']
  ['craigfernandez.tumblr.com', 'yungcrybby-anonymousbosch666.tumblr.com']
  ['zaufaneopinie.smile.pl', 'crazyneedles.pl']
  ['winston-ramone.tumblr.com', 'dana-chan-the-control-brain.tumblr.com']
  ['datalend.com', 'www.equilend.com', 'orbisa.com']
  ['fr.prolewiki.org', 'pt.prolewiki.org', 'ru.prolewiki.org', 'es.prolewiki.org', 'el.prolewiki.org', 'de.prolewiki.org', 'en.prolewiki.org', 'zh.prolewiki.org', 'fa.prolewiki.org']
  ['magicalgirlfia.tumblr.com', 'dedf1shloveblog.tumblr.com', 'vampire-pierrot.tumblr.com']
  ['www.wheelt.pt', 'www.isjd.pt']
  ['docs.folio.org', 'dev.folio.org']
  ['joshcomix.wordpress.com', 'diningwithstrangers.com']
  ['www.stackone.com', 'docs.stackone.com', 'stackone.com']
  ['dominateeye.tumblr.com', 'pauein.tumblr.com']
  ['not-a-robot-i-swear.tumblr.com', 'dyneue.tumblr.com']
  ['electronicgallery.tumblr.com', 'gallusdrawseverything.tumblr.com']
  ['endowment.hse.ru', 'spasibo.hse.ru', 'icef.hse.ru', 'finance.hse.ru']
  ['radnext.web.cern.ch', 'irradiation-facilities.web.cern.ch']
  ['www.rich2020.eu', 'erigrid2.eu']
  ['www.mainichigrillbu.com', 'for-biz.noritz.co.jp', 'form.noritz.co.jp', 'mypage.noritz.co.jp', 'faq.noritz.co.jp']
  ['fiftyshadesofgreywiki.tumblr.com', 'thefashionwiki-blog.tumblr.com', 'thedietwiki.tumblr.com']
  ['ggpi.blogspot.com', 'findyou.blogspot.com']
  ['foampro.com', 'fireresearch.com']
  ['fishzlgroup.ru', 'foodforfitness.ru']
  ['flowersinbloomnothingtoaddteatime.wordpress.com', 'thebookwormdrinketh.com']
  ['fpdcc.com', 'www.brookfieldzoo.org', 'www.czs.org']
  ['orders.gelatex.com', 'gelatex.com']
  ['russian.languagedaily.com', 'german.languagedaily.com']
  ['gotamedia.se', 'www.gotamedia.se']
  ['gotladies.tumblr.com', 'merlinadementiasnow.tumblr.com', 'joanna-lannister.tumblr.com']
  ['heavenssexiestangel.tumblr.com', 'spnfanficpond.tumblr.com']
  ['store.stamps.com', 'help.stamps.com']
  ['intti.fi', 'merivoimat.fi', 'maanpuolustuskorkeakoulu.fi', 'upseeriksi.fi', 'ilmavoimat.fi']
  ['industrial.seasonic.com', 'investor.seasonic.com']
  ['nnw.ranchero.com', 'inessential.com']
  ['iphodblog.blogspot.com', 'www.iphod.com']
  ['is.waw.pl', 'is.rzeszow.pl']
  ['itre.ncsu.edu', 'www.ncbussafety.org']
  ['jucaramarcal.bandcamp.com', 'jadsa.bandcamp.com']
  ['plenti.co', 'jantcu.com']
  ['www.covalliero.com', 'katalog.kerbl.com']
  ['tonyballantyne.com', 'keithbrooke.wordpress.com']
  ['lilas22.exblog.jp', 'uluru115.exblog.jp']
  ['www.loket.com', 'loket.com']
  ['nemosquirrel.tumblr.com', 'spacialdimension.tumblr.com']
  ['seethawithus.tumblr.com', 'seaairra.tumblr.com']
  ['ulvesang.bandcamp.com', 'muskoxofficial.bandcamp.com', 'thurnin.bandcamp.com']
  ['wondertrio.tumblr.com', 'mandiminimojo.tumblr.com']
  ['omarandjohnny.tumblr.com', 'mandrakebrew.tumblr.com']
  ['www.medizinischerdienst.de', 'md-bund.de', 'www.igel-monitor.de']
  ['norr.iogt.se', 'mitt.iogt.se', 'ost.iogt.se', 'pumpen.iogt.se', 'sydost.iogt.se']
  ['museumstudiesabroad.org', 'popkult.org']
  ['naoseidesenhar.substack.com', 'navisorbi.substack.com']
  ['nat.org.uk', 'www.nat.org.uk']
  ['zapiskijoanny30.wordpress.com', 'zyciecelta.wordpress.com', 'niecodziennik.org']
  ['teddyberr.tumblr.com', 'nyanbinaryrose.tumblr.com']
  ['oilcountryhq.com', 'oilersgamedaylive.com']
  ['panpteryx.tumblr.com', 'wyrddogs.tumblr.com']
  ['planetrdf.com', 'www.dajobe.org']
  ['wiki.pointlinux.org', 'pointlinux.org']
  ['ponvoryus.com', 'www.vandapharma.com']
  ['shaeeldera.tumblr.com', 'skirris.tumblr.com']
  ['rabbitroom.substack.com', 'rabbitroommusic.substack.com', 'store.rabbitroom.com', 'rabbitroom.com']
  ['raven-2.de.uptodown.com', 'raven-2.uptodown.com']
  ['www.hnd.hr', 'safejournalists.net']
  ['scp-wiki-nos.wikidot.com', 'scpsandboxnos.wikidot.com']
  ['undercoverbrellla.tumblr.com', 'whimsipunk.tumblr.com', 'ten-mou.tumblr.com']
  ['www.onehope.net', 'store.onehope.net']
  ['www.sundials.org', 'sundials.org']
  ['support.stride.zone', 'www.stride.zone']
  ['wiki.freshtomato.org', 'www.linksysinfo.org']
  ['www.unicohotels.com', 'www.thelodgemallorca.com', 'www.theprincipalmadridhotel.com', 'www.fincaserenamallorca.com', 'www.fincalabobadilla.com', 'theluxuryeditor.com']
  ['www.therex.ca', 'therex.ca', 'www.therexshop.ca']
  ['thinkpad-forum.de', 'thinkwiki.de']
  ['trustedtraders.which.co.uk', 'which.co.uk', 'whichwills.which.co.uk']
  ['veganshop.gmbh', 'www.veganbook.info', 'www.provegan.info']
  ['www.ua-bw.de', 'verbraucherportal-bw.de']
  ['webpub2.igae.hacienda.gob.es', 'www.oficinavirtual.pap.hacienda.gob.es']
  ['webshop.provendo.no', 'www.provendo.no']
  ['wiki.iots.vip', 'www.iots.vip']
  ['wiki.recalbox.com', 'www.recalbox.com']
  ['www.jinnianlun.cn', 'www.jipinhong.cn', 'www.jixif.cn', 'www.jlhuoyun.cn', 'www.jlxty.cn', 'www.jmsjp.com.cn', 'www.jndpf.org.cn', 'www.jnksq.cn', 'www.job5191.cn', 'www.jobss.com.cn', 'www.joryl.cn', 'www.jpcabal.cn', 'www.jsbcf.cn', 'www.jsbyzj.cn', 'www.jsfsx.com.cn', 'www.jshbkjgs.cn', 'www.jshiggs.cn', 'www.jsnw.com.cn', 'www.jssjgxxw.cn', 'www.jsywl.cn', 'www.juhuibao.com.cn', 'www.julinfloor.cn', 'www.jupaio.com.cn', 'www.jxchangrong168.cn', 'www.jyjyj.cn', 'www.k345.cn', 'www.kaikenuo.cn', 'www.kaitedj.cn', 'www.kaizhou-edu.cn', 'www.kancept.cn', 'www.kedele.cn', 'www.keidang.com.cn', 'www.kelinsi.cn', 'www.kellymoss.com.cn', 'www.keyu.net.cn', 'www.kfkeji.cn', 'www.khanate.cn', 'www.kijkbxw.cn', 'www.kindak.cn', 'www.komba.cn', 'www.konjacgum.com.cn', 'www.kpdsxw.cn', 'www.kq86.cn', 'www.kuangshan.net.cn', 'www.kucap.cn', 'www.ladj.com.cn', 'www.lareboss.cn', 'www.lc95.cn', 'www.lcpipe.cn', 'www.lcqsn.org.cn', 'www.lelaso.com.cn', 'www.lemonhotel.cn', 'www.lfjj8.cn', 'www.lilangjx.cn', 'www.llmc8.cn', 'www.lnch.com.cn', 'www.lounue.cn', 'www.lovelymama.cn', 'www.loves22.cn', 'www.lovoshop.cn', 'www.lqcmmc.cn', 'www.lqm889.cn', 'www.lqrgj.cn', 'www.lrogen.cn', 'www.ltic.com.cn', 'www.luhongsuye.cn', 'www.luxrose.cn', 'www.luyjpa.cn', 'www.lvzejun.cn', 'www.ly519.cn', 'www.lycdsy.cn', 'www.lygcec.cn', 'www.lyjbt.cn', 'www.lyswdx.cn', 'www.lzhwzl.cn', 'www.m216.cn', 'www.madier.com.cn', 'www.maincom.com.cn', 'www.makesoft.com.cn', 'www.maltaese.com.cn', 'www.manong.net.cn', 'www.maxigo.com.cn', 'www.mcjmxx.cn', 'www.megsine.cn', 'www.meidabz.cn', 'www.meishujiameng.cn', 'www.meizhiquan.cn', 'www.merrykey.cn', 'www.metalz.com.cn', 'www.mfrank.cn', 'www.miaomiaobei.cn', 'www.midea020.com.cn', 'www.mikebag.com.cn', 'www.milan-station.cn', 'www.mingsheshangxuan.cn', 'www.mishu99.cn', 'www.mmbuy.cn', 'www.mmyj.com.cn', 'www.mnjxc.cn', 'www.moershen.com.cn', 'www.mold-industry.cn', 'www.mortisingmachine.com.cn', 'www.muxika.com.cn', 'www.myhousecare.com.cn', 'www.mytalents.com.cn', 'www.nanlace.com.cn', 'www.nbbus.com.cn', 'www.nbhwwh.cn', 'www.nblkq02.cn', 'www.nbmagnet.cn', 'www.nc365.cn', 'www.nethn.cn', 'www.neunited.cn', 'www.new-new.cn', 'www.nicepar.cn', 'www.nj-sy.cn', 'www.njrgw.cn', 'www.njspx.com.cn', 'www.nju-edu.cn', 'www.njwdkj.cn', 'www.nnls.net.cn', 'www.nongyeshebei.cn', 'www.nooaoo.cn', 'www.nphjw.cn', 'www.nxlhwhysp.cn', 'www.nyhtt.cn', 'www.oneting.cn', 'www.ootfirz.cn', 'www.osdeng.cn', 'www.osxg.com.cn', 'www.palak.cn', 'www.pan-art.cn', 'www.pandababy.com.cn', 'www.panx.com.cn', 'www.papiorecycle.cn', 'www.parkal.com.cn', 'www.pieda.cn', 'www.pingdinglian.cn', 'www.pkups.com.cn', 'www.pl-pefilm.cn', 'www.pop-mm.cn', 'www.princeofpeace.cn', 'www.proteusfitness.cn', 'www.protex.net.cn', 'www.pstry.cn', 'www.ptan.cn', 'www.ptzzb.cn', 'www.pubad.com.cn', 'www.pushite.cn', 'www.pytyjy.net.cn', 'www.qcxmk.cn', 'www.qdone.cn', 'www.qdsptgm.cn', 'www.qdxintai.cn', 'www.qianbanjiage.cn', 'www.qifugu.com.cn', 'www.qingyanghualv.com.cn', 'www.qiyongdong.cn', 'www.qjba.cn', 'www.qlif.cn', 'www.qm139.com.cn', 'www.qnfty.cn', 'www.qs-zm.cn', 'www.qutaobao.cn', 'www.qxjh.cn', 'www.qyxbw.cn', 'www.qzjiuhua.com.cn', 'www.rdsptech.cn', 'www.redbaobao.cn', 'www.ree.net.cn', 'www.rockins.cn', 'www.romond.cn', 'www.ruanzhoubeng.cn', 'www.ruicaotang.cn', 'www.ruidisen.cn', 'www.russiaguoxin.cn', 'www.salira.com.cn', 'www.sanhehg.cn', 'www.sbytech.cn', 'www.scqsq.cn', 'www.sdevent.cn', 'www.sdhry.com.cn', 'www.sdicl.com.cn', 'www.sdlove.com.cn', 'www.sdyingyue.cn', 'www.senliao.com.cn', 'www.seotop1.cn', 'www.sfj1236.com.cn', 'www.sglsw.com.cn', 'www.sh-wood.com.cn', 'www.shautoexpo.org.cn', 'www.shbashiwl.cn', 'www.shchenwang.com.cn', 'www.shengjiemoye.cn', 'www.shengxingabion.cn', 'www.shhc.org.cn', 'www.shhqw.com.cn', 'www.shhydl.cn', 'www.shiningblue.cn', 'www.shoueryouyang.cn', 'www.shrailway.com.cn', 'www.shsose.com.cn', 'www.shtkrkq.cn', 'www.shubiao.net.cn', 'www.shuhuazhi.cn', 'www.shunhead.cn', 'www.shzhiying.cn', 'www.shzkb.cn', 'www.sjksgs.cn', 'www.sjmhg.com.cn', 'www.sjmyjd.cn', 'www.sjmz.com.cn', 'www.sjtvip.cn', 'www.sk010.cn', 'www.skmtech.cn', 'www.slrfl.cn', 'www.smartaudit.com.cn', 'www.sn999.cn', 'www.snmen.cn', 'www.snweifeng.cn', 'www.songyouhui.cn', 'www.sosolala.com.cn', 'www.space-time.com.cn', 'www.spfbw.cn', 'www.sq148.com.cn', 'www.srfengguanji.cn', 'www.sscar.com.cn', 'www.stadytime.cn', 'www.staei.cn', 'www.stageline.cn', 'www.stamp99.cn', 'www.steel-grating.cn', 'www.stock6678.cn', 'www.stopthatsnoring.com.cn', 'www.suisuipingan.com.cn', 'www.sunhaiwei.cn', 'www.sunnybay.com.cn', 'www.sustid.cn', 'www.suval.com.cn', 'www.sxoffice.com.cn', 'www.sxtdybio.cn', 'www.sxxrbz.cn', 'www.sycste.org.cn', 'www.sygydxxb.cn', 'www.syxscy.cn', 'www.sz-zhw.cn', 'www.sz2783.cn', 'www.szbgs.com.cn', 'www.szhuanair.com.cn', 'www.szjinyu.cn', 'www.szjy88.cn', 'www.szmt56.cn', 'www.szpsf.cn', 'www.szqctsy.cn', 'www.szqxwq.cn', 'www.szryxgd.com.cn', 'www.szxaoa.cn', 'www.t44867k.cn', 'www.chongqingbidan.cn', 'www.tchjd.cn', 'www.test99.com.cn', 'www.010316.com.cn', 'www.thepaper.net.cn', 'www.023-tl.cn', 'www.0411autos.cn', 'www.0580u.cn', 'www.0592178.cn', 'www.thjdsb.cn', 'www.thkzxxx.cn', 'www.0816jcw.cn', 'www.tianlaicun.cn', 'www.0991led.cn', 'www.tianyugg.cn', 'www.100lang.cn', 'www.100msm.cn', 'www.100gps.com.cn', 'www.11d15c.cn', 'www.timings.cn', 'www.1236321.cn', 'www.12sgzjt.cn', 'www.tit.net.cn', 'www.tj800.cn', 'www.15977.cn', 'www.163edu.com.cn', 'www.tjnhsafety.cn', 'www.tjsszw.cn', 'www.17592.cn', 'www.tkdc.com.cn', 'www.17tb8.cn', 'www.tld.net.cn', 'www.tlxuba.cn', 'www.17thjsgames.org.cn', 'www.1d1l.org.cn', 'www.2020777.cn', 'www.202078.cn', 'www.21dmedia.net.cn', 'www.21it.com.cn', 'www.tlfrk.cn', 'www.2222110.cn', 'www.234zhe.cn', 'www.tongjijujia.cn', 'www.tongchuntang.com.cn', 'www.25427187.cn', 'www.26333.cn', 'www.tongfasolar.cn', 'www.2cha.cn', 'www.28sj.net.cn', 'www.tooren.cn', 'www.topvista.cn', 'www.339966.com.cn', 'www.360qvod.cn', 'www.tradevv.cn', 'www.traditionalmedicine.com.cn', 'www.3n168.cn', 'www.3wsj.cn', 'www.3xwd.cn', 'www.trafficabc.cn', 'www.414313.com.cn', 'www.47177.cn', 'www.4kuu.cn', 'www.51777888.cn', 'www.tsyimin.cn', 'www.51jiankang.com.cn', 'www.51kafu.cn', 'www.ttua.cn', 'www.ttmmuyegs.cn', 'www.51sd.com.cn', 'www.520wenda.cn', 'www.52dgou.cn', 'www.tusafe.cn', 'www.52yjm.cn', 'www.55sssf.cn', 'www.56710.cn', 'www.5777777.cn', 'www.591ey.cn', 'www.ty39.cn', 'www.txhy-audio.com.cn', 'www.tz10000.cn', 'www.5wsh.cn', 'www.txty.com.cn', 'www.txyp185.cn', 'www.66kg.cn', 'www.5udns.cn', 'www.67303.com.cn', 'www.6781.com.cn', 'www.6825.org.cn', 'www.6d3.com.cn', 'www.uepu.cn', 'www.70847.cn', 'www.uiut.cn', 'www.6m.org.cn', 'www.ukonline.com.cn', 'www.ujnr.cn', 'www.77gou.com.cn', 'www.777ht.cn', 'www.uhn98.cn', 'www.80anmo.cn', 'www.unicome.cn', 'www.82691.cn', 'www.789mmm.cn', 'www.87ge.cn', 'www.88131420.cn', 'www.884444.com.cn', 'www.88miaomu.cn', 'www.uqen.cn', 'www.85012.cn', 'www.8xiu.com.cn', 'www.utosee.cn', 'www.uwds.cn', 'www.v3d.com.cn', 'www.91hubei.cn', 'www.vastchip.com.cn', 'www.abccompanies.com.cn', 'www.vastorient.com.cn', 'www.ac163.com.cn', 'www.acseo.cn', 'www.actword.cn', 'www.acutec.cn', 'www.adenstar.com.cn', 'www.vic365.cn', 'www.advtekgroup.com.cn', 'www.vnrg.cn', 'www.ahxhzy.cn', 'www.vr163.com.cn', 'www.vsg-ad.cn', 'www.w-qq.cn', 'www.wabaowang.com.cn', 'www.wailianwang.com.cn', 'www.wangkuandian.cn', 'www.akqe.cn', 'www.wangqicai.cn', 'www.wangyameit.cn', 'www.wangyongtuox.com.cn', 'www.alib.com.cn', 'www.wblshbx.cn', 'www.wdqkx.org.cn', 'www.webaiye.cn', 'www.alnmpci.cn', 'www.webtrend.cn', 'www.ampte.com.cn', 'www.weizailink.cn', 'www.weizhijiaoyu.cn', 'www.anandishanghai.cn', 'www.werc.cn', 'www.andeli88.com.cn', 'www.westinvest.net.cn', 'www.westyy.cn', 'www.wfjdjx.cn', 'www.whatisultimate.cn', 'www.wheelstar.com.cn', 'www.whrsrc.cn', 'www.aojuan.cn', 'www.aolida-ic.cn', 'www.apearl.cn', 'www.aqst.com.cn', 'www.wklmy.com.cn', 'www.wm520.com.cn', 'www.wmoeck.cn', 'www.wnbe.cn', 'www.wo4000.com.cn', 'www.arkmid.cn', 'www.wode373.cn', 'www.wonf.cn', 'www.art360.com.cn', 'www.world-famous.com.cn', 'www.arthroscopy.cn', 'www.woyemaicha.com.cn', 'www.worldgift.com.cn', 'www.asiafriender.cn', 'www.wroz.cn', 'www.wucaige.cn', 'www.wxaw.org.cn', 'www.wyx007.cn', 'www.wz2.com.cn', 'www.xa77.cn', 'www.xalove.com.cn', 'www.xamj.net.cn', 'www.xamqy.org.cn', 'www.xaws.com.cn', 'www.xcgm.com.cn', 'www.avonair.com.cn', 'www.avast1.cn', 'www.xf701218.cn', 'www.xguv.com.cn', 'www.xiangyangyuju.cn', 'www.xianzengjia.cn', 'www.xiaoflash.cn', 'www.bakeyuansu.cn', 'www.ballaz.cn', 'www.xiaomoo.cn', 'www.bandao111.cn', 'www.xiebao361.cn', 'www.baoshengtai.cn', 'www.xindth.cn', 'www.xingfuyingyuan.com.cn', 'www.xinhongbo.cn', 'www.xinhuajinrong.cn', 'www.bb5y.com.cn', 'www.xinjiamei.com.cn', 'www.bczh.com.cn', 'www.xintai668.cn', 'www.xinqianyou.cn', 'www.xinmedia.cn', 'www.bdshyy.cn', 'www.xlfly.com.cn', 'www.beifengshan.com.cn', 'www.xinyuanshun.cn', 'www.xrcorp.com.cn', 'www.xsz123.com.cn', 'www.xt2.com.cn', 'www.xuancuiju.com.cn', 'www.xyditan.com.cn', 'www.bignature.com.cn', 'www.xytmc.com.cn', 'www.xzcl.org.cn', 'www.xzxxz.cn', 'www.yaozhaoshang.com.cn', 'www.ybhuntun.cn', 'www.ybzh.com.cn', 'www.bistone.cn', 'www.ycflxx.com.cn', 'www.bjdxh.com.cn', 'www.bjelc.com.cn', 'www.bjhkkj.cn', 'www.bjhyyf.cn', 'www.yczp5.cn', 'www.ydczns.com.cn', 'www.bjtongyao.com.cn', 'www.yesv.com.cn', 'www.yfdianxiaoka.cn', 'www.bjyzmd.cn', 'www.yhhenglish.cn', 'www.yi-sheng.cn', 'www.yida365.com.cn', 'www.blogkid.cn', 'www.yiment.cn', 'www.yingjia01.cn', 'www.bmg88.cn', 'www.bodakj.com.cn', 'www.yinhedl.cn', 'www.yiyizuche.cn', 'www.ykbm.com.cn', 'www.ykgg.com.cn', 'www.yls188.cn', 'www.bopie.com.cn', 'www.yluxuepian.cn', 'www.ynrnm.cn', 'www.ynjlms.cn', 'www.ynttt.com.cn', 'www.yohotalk.cn', 'www.yongshengjx.cn', 'www.bsd88.cn', 'www.ynsfwh.cn', 'www.youfamily.net.cn', 'www.youh.net.cn', 'www.youngel.cn', 'www.ysxjkjd.cn', 'www.ytjl168.cn', 'www.c-art.cn', 'www.c116.cn', 'www.yuansheying.com.cn', 'www.ytsmc.com.cn', 'www.cafebabe.cn', 'www.yumovip.cn', 'www.caihongqiao.org.cn', 'www.yuxibolt.cn', 'www.yuxiqing.cn', 'www.yuyuanxiang.cn', 'www.yufdc.cn', 'www.yxsite.com.cn', 'www.carjapan.com.cn', 'www.yzjly.cn', 'www.yzsfdc.cn', 'www.yzxx188.com.cn', 'www.cbdc1.cn', 'www.cby138.cn', 'www.cchengtai.cn', 'www.zbshebao.cn', 'www.ccyyi.cn', 'www.cddkfw.cn', 'www.cdsafety.com.cn', 'www.zdmapsj.cn', 'www.zdbmw.cn', 'www.cdwll.cn', 'www.zfmj.com.cn', 'www.zengbincc.cn', 'www.zggxiqy.cn', 'www.zbsugang.com.cn', 'www.cfuclub.cn', 'www.zgmmby.cn', 'www.zgpaz.cn', 'www.zgtaixu.cn', 'www.zgyxscw.com.cn', 'www.666cp.cn', 'www.cheeloosoft.com.cn', 'www.zhanglangkexing.cn', 'www.chemgoo.cn', 'www.zhanjiangwuliu.cn', 'www.chest.org.cn', 'www.zhaoji.net.cn', 'www.chengdawenzhou.cn', 'www.chidexiao.cn', 'www.chikee.com.cn', 'www.zhengloulipin.cn', 'www.zhilengqi.com.cn', 'www.zhilijiaren.cn', 'www.zhnyw.cn', 'www.zhongjian.net.cn', 'www.chstar.cn', 'www.zhongtai.net.cn', 'www.cifexpo.com.cn', 'www.zhongwone.cn', 'www.cjwu.cn', 'www.ckje.cn', 'www.chu-ming.com.cn', 'www.zhspw.com.cn', 'www.cilaya.cn', 'www.zhutanq.cn', 'www.zhwdw.cn', 'www.zj-one.cn', 'www.zj-zzhb.cn', 'www.zjbldlt.cn', 'www.zkeea.cn', 'www.cncns.cn', 'www.cncye.cn', 'www.zlhx.com.cn', 'www.zndxr.cn', 'www.cnkawayi.cn', 'www.cnlebao.cn', 'www.cnzkd.cn', 'www.zouzha.cn', 'www.zs-weike.cn', 'www.zrimp.cn', 'www.co998.cn', 'www.zshnet.cn', 'www.zshx88.com.cn', 'www.zsoa.com.cn', 'www.zt007.cn', 'www.zt386.cn', 'www.comef51.cn', 'www.zuoyuedoor.cn', 'www.colincctv.com.cn', 'www.zwwzdq.cn', 'www.zyzjq.com.cn', 'www.zz-dns.cn', 'www.zz001.com.cn', 'www.zzwy.com.cn', 'www.cqgyp.cn', 'www.cqsqfy.com.cn', 'www.cqwhmy.cn', 'www.cqxyg.com.cn', 'www.cqycc.org.cn', 'www.crep-led.cn', 'www.810086.com.cn', 'www.csspring.cn', 'www.ctscloud.cn', 'www.cuanet.org.cn', 'www.cxbook.com.cn', 'www.cz-xd.cn', 'www.czaxmy.cn', 'www.czcmjk.com.cn', 'www.czqahb.cn', 'www.cztengguan.cn', 'www.d1dy.cn', 'www.dajiawang.com.cn', 'www.dalianwk.cn', 'www.danif.cn', 'www.dansuan88.cn', 'www.daqiall.cn', 'www.dbyf.com.cn', 'www.ddxs.org.cn', 'www.dediu.cn', 'www.dfcjw.cn', 'www.dgeye.com.cn', 'www.dggaoda.cn', 'www.dghyfirm.cn', 'www.dgssjj.cn', 'www.dgxingao.com.cn', 'www.dicvideo.com.cn', 'www.dingleidoors.cn', 'www.dnsbw.com.cn', 'www.dosome.com.cn', 'www.downloading.com.cn', 'www.dr58.cn', 'www.drglass.cn', 'www.dseoul.cn', 'www.dsp-sz.cn', 'www.dtrclub.cn', 'www.dukemen.cn', 'www.dxt-data.cn', 'www.dy368.cn', 'www.dzzhjhsb.cn', 'www.e-youbao.cn', 'www.easyrecovery.com.cn', 'www.ecou.cn', 'www.edlk.cn', 'www.edrc.com.cn', 'www.egc.net.cn', 'www.egozone.cn', 'www.eguluomin.cn', 'www.eilv.com.cn', 'www.eliang.com.cn', 'www.enerbos.cn', 'www.enfi-yq.com.cn', 'www.engpv.com.cn', 'www.eoaoo.com.cn', 'www.eoopoo.com.cn', 'www.epioo.cn', 'www.eroda.net.cn', 'www.estsc.cn', 'www.faironline.com.cn', 'www.fanchaoo.cn', 'www.fayao.com.cn', 'www.fcnysbc.cn', 'www.feifan360.cn', 'www.feikedaili.cn', 'www.fenghuatea.cn', 'www.fengnaier.cn', 'www.feplc.cn', 'www.fgfkj.cn', 'www.firstar.net.cn', 'www.fjnh.com.cn', 'www.foammachine.cn', 'www.frontid.com.cn', 'www.fs-huamei.com.cn', 'www.fs-robot.cn', 'www.fshsdq.com.cn', 'www.fssdsh.cn', 'www.fstianyou.cn', 'www.fuliao.org.cn', 'www.funsan.cn', 'www.fuxx.cn', 'www.fuyisi.cn', 'www.fwt-a.cn', 'www.fzlexus.com.cn', 'www.gangsiwowo.cn', 'www.gaoxueya5.com.cn', 'www.gch.net.cn', 'www.gdwdy.cn', 'www.gefitinib.com.cn', 'www.geleite.cn', 'www.gfs8580.cn', 'www.ggitech.com.cn', 'www.ggj.net.cn', 'www.ggnkyy.cn', 'www.gicommittee.com.cn', 'www.gjjr.com.cn', 'www.gold0559.cn', 'www.gongfuyu.com.cn', 'www.good-pay.cn', 'www.gq365.cn', 'www.greenshow.cn', 'www.gszbz.com.cn', 'www.gt88.cn', 'www.guangfatent.cn', 'www.guanghuahuashi.cn', 'www.guojinvzhuangpifa.net.cn', 'www.guomao85.cn', 'www.guowei-pbx.com.cn', 'www.guoyuanwai.cn', 'www.gwcb.com.cn', 'www.gxsmjbi.cn', 'www.gyfudiao.cn', 'www.gz-sjkj.com.cn', 'www.gz8u8.cn', 'www.gzbhhd.cn', 'www.gzhlkj.cn', 'www.gzjieke.cn', 'www.gzjinrun.cn', 'www.gzjyb.com.cn', 'www.gzkjjs.cn', 'www.gzluodan.cn', 'www.gzsckw.cn', 'www.gzzj020.cn', 'www.haiandasha.cn', 'www.haizhifeng.cn', 'www.hansudj.cn', 'www.hanting114.cn', 'www.hanxueshop.cn', 'www.haojb.cn', 'www.hawkinfo.com.cn', 'www.hdqshy.cn', 'www.healthyst.com.cn', 'www.hemaie.cn', 'www.hezudao52.cn', 'www.hf-tech.cn', 'www.hfzxlw.cn', 'www.hgj.org.cn', 'www.hgldt.cn', 'www.hhjie.cn', 'www.hi-tone.cn', 'www.hi0543.cn', 'www.hifi5.com.cn', 'www.hiltondalian.cn', 'www.hitecmen.com.cn', 'www.hjgz18.cn', 'www.hlzhizao.cn', 'www.hmbiz.cn', 'www.hn88.cn', 'www.hnhzxtd.cn', 'www.hnslhzx.cn', 'www.hnydw.cn', 'www.hnyzssy.cn', 'www.hnzbdb.cn', 'www.hoboob.cn', 'www.hongtong168.cn', 'www.huaan168.com.cn', 'www.huagaoxi.cn', 'www.huaisutang.cn', 'www.huanghaiwang.com.cn', 'www.huangxibo.cn', 'www.huashuoel.cn', 'www.huidali.cn', 'www.hxbox.com.cn', 'www.hy663.cn', 'www.hydpf.org.cn', 'www.hytaxedu.cn', 'www.hzlsnz.cn', 'www.hztuoyu.cn', 'www.i-europe.cn', 'www.ia8848.cn', 'www.ibmcenter.com.cn', 'www.icclaw.com.cn', 'www.idc5588.cn', 'www.ie-baidu.cn', 'www.ih4.com.cn', 'www.ihongtu.cn', 'www.ikbpt.cn', 'www.ilebao.cn', 'www.im-ligang.cn', 'www.inonline.cn', 'www.interwest.com.cn', 'www.ionizedwater.cn', 'www.itku.com.cn', 'www.itwyw.cn', 'www.iweihai.com.cn', 'www.j-wanc.com.cn', 'www.jasminetea1.cn', 'www.javadown.com.cn', 'www.jbbabycare.cn', 'www.jbs-engines.com.cn', 'www.jf-net.com.cn', 'www.jfyfzgs.com.cn', 'www.jiahecaifu.cn', 'www.jiamengso.cn', 'www.jiayixuan.cn', 'www.jinboyifang.cn', 'www.jinfeng-sh.com.cn', 'www.jingmeiren.cn', 'www.jingyinxiang.cn', 'www.jinhuowang.com.cn']
  ['www.ryestreettavern.com', 'www.ebbitt.com', 'www.cordeliadc.com', 'www.clydesgroup.com', 'www.1789restaurant.com', 'www.tombs.com']
  ['www.capitalrowing.org', 'www.anacostiaboathouse.org']
  ['www.bakersdaughterdc.com', 'www.michelesdc.com', 'www.gravitasdc.com', 'www.giftrocker.com']
  ['www.bgsaxo.it', 'www.help.saxo']
  ['yau-contest.com', 'www.cms.zju.edu.cn']
  ['www.fujisash-grp-netshop.jp', 'www.facing-online.com', 'www.fujisash.co.jp']
  ['www.fackelmann.com', 'www.fackelmann.de']
  ['www.heristo.de', 'www.ferdi-fuchs.de', 'www.meat2000.de', 'www.youcook-food.com', 'www.servit.de', 'www.stockmeyer.de']
  ['www.montresalafrancaise.fr', 'www.franceclat.fr', 'www.formations-hbjo.com']
  ['www.kansai-helios.eu', 'www.greblon.com']
  ['www.linuxexpres.cz', 'www.openoffice.cz']
  ['www.nevadacitychamber.com', 'www.nevadacountyarts.org']
  ['www.ondemandkorea.com', 'www.odkmedia.net']
  ['www.rosenthal.de', 'www.paderno.it']
  ['www.wordfast.com', 'www.wordfast.net']
  CPU times: user 1.5 s, sys: 9.12 ms, total: 1.51 s
  Wall time: 1.51 s
#+end_example

#+begin_src jupyter-python
  H = G.subgraph([n for c in cs for n in c])
  # nx.draw(H)
#+end_src

#+RESULTS:
: bcbfd17a-3d85-476d-be85-ce0c43de1884


# # Local Variables:
# eval: (add-hook 'org-babel-tangle-body-hook (lambda nil (beginning-of-buffer) (replace-string "%%time" "")))
# End:
